app/Models/PessoasModel.php

SELECT *
FROM `tb_pessoas`
---
    public function getPessoas(){
        return $this->findAll();

SELECT *
FROM `tb_pessoas`
WHERE `id` = '2'
 LIMIT 1
---
    public function getPessoa($id){
        return $this->asArray()->where(['id'=>$id])->first();